name : "test"
layer {
  name:"im_id"
  type:"dlr_input"
  top:"im_id"
  layer_param {
    idx:0
    out_0 {name:"im_id:0",dtype:int64,layout:NC,shape:[1, 1]}
    opconfigs {op_role:0,op_namescope:"/",col:0,op_device:"",op_role_var:[],name:"im_id"}
    opattrs {shape:[1, 1]}
  }
}
layer {
  name:"im_size"
  type:"dlr_input"
  top:"im_size"
  layer_param {
    idx:1
    out_0 {name:"im_size:0",dtype:int32,layout:NC,shape:[1, 2]}
    opconfigs {op_role:0,op_namescope:"/",col:1,op_device:"",op_role_var:[],name:"im_size"}
    opattrs {shape:[1, 2]}
  }
}
layer {
  name:"image"
  type:"dlr_input"
  top:"image"
  layer_param {
    idx:2
    out_0 {name:"image:0",dtype:float32,layout:NCHW,shape:[1, 3, 608, 608]}
    opconfigs {op_role:0,op_namescope:"/",col:2,op_device:"",op_role_var:[],name:"image"}
    opattrs {shape:[1, 3, 608, 608]}
  }
}
layer {
  name:"conv1_1"
  type:"conv2d"
  top:"conv1_1"
  bottom:"image"
  layer_param {
    idx:3
    in_0 {name:"image:0",dtype:float32,layout:NCHW,shape:[1, 3, 608, 608]}
    out_0 {name:"conv1_1:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    weight {name:"conv1_1_weights",dtype:float32,layout:OIHW,shape:[32, 3, 3, 3]}
    opconfigs {num_filters:32,filter_size:3,stride:2,padding:1,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('conv1_1_weights')",bias_attr:None}
    opattrs {num_filter:32,kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[2, 2],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bnv1_1"
  type:"batch_norm"
  top:"bnv1_1"
  bottom:"conv1_1"
  layer_param {
    idx:4
    in_0 {name:"conv1_1:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    out_0 {name:"bnv1_1:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    gamma {name:"bnv1_1_scale",dtype:float32,layout:O,shape:[32]}
    beta {name:"bnv1_1_offset",dtype:float32,layout:O,shape:[32]}
    mean {name:"bnv1_1_mean",dtype:float32,layout:O,shape:[32]}
    var {name:"bnv1_1_variance",dtype:float32,layout:O,shape:[32]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bnv1_1_scale')",bias_attr:"ParamAttr('bnv1_1_offset')",data_layout:"NCHW",moving_mean_name:"bnv1_1_mean",moving_variance_name:"bnv1_1_variance",use_global_stats:False,name:"bnv1_1"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_0"
  type:"relu"
  top:"relu_0"
  bottom:"bnv1_1"
  layer_param {
    idx:5
    in_0 {name:"bnv1_1:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    out_0 {name:"relu_0:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    opconfigs {name:"relu_0"}
  }
}
layer {
  name:"conv1_2"
  type:"conv2d"
  top:"conv1_2"
  bottom:"relu_0"
  layer_param {
    idx:6
    in_0 {name:"relu_0:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    out_0 {name:"conv1_2:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    weight {name:"conv1_2_weights",dtype:float32,layout:OIHW,shape:[32, 32, 3, 3]}
    opconfigs {num_filters:32,filter_size:3,stride:1,padding:1,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('conv1_2_weights')",bias_attr:None}
    opattrs {num_filter:32,kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bnv1_2"
  type:"batch_norm"
  top:"bnv1_2"
  bottom:"conv1_2"
  layer_param {
    idx:7
    in_0 {name:"conv1_2:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    out_0 {name:"bnv1_2:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    gamma {name:"bnv1_2_scale",dtype:float32,layout:O,shape:[32]}
    beta {name:"bnv1_2_offset",dtype:float32,layout:O,shape:[32]}
    mean {name:"bnv1_2_mean",dtype:float32,layout:O,shape:[32]}
    var {name:"bnv1_2_variance",dtype:float32,layout:O,shape:[32]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bnv1_2_scale')",bias_attr:"ParamAttr('bnv1_2_offset')",data_layout:"NCHW",moving_mean_name:"bnv1_2_mean",moving_variance_name:"bnv1_2_variance",use_global_stats:False,name:"bnv1_2"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_1"
  type:"relu"
  top:"relu_1"
  bottom:"bnv1_2"
  layer_param {
    idx:8
    in_0 {name:"bnv1_2:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    out_0 {name:"relu_1:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    opconfigs {name:"relu_1"}
  }
}
layer {
  name:"conv1_3"
  type:"conv2d"
  top:"conv1_3"
  bottom:"relu_1"
  layer_param {
    idx:9
    in_0 {name:"relu_1:0",dtype:float32,layout:NCHW,shape:[1, 32, 304, 304]}
    out_0 {name:"conv1_3:0",dtype:float32,layout:NCHW,shape:[1, 64, 304, 304]}
    weight {name:"conv1_3_weights",dtype:float32,layout:OIHW,shape:[64, 32, 3, 3]}
    opconfigs {num_filters:64,filter_size:3,stride:1,padding:1,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('conv1_3_weights')",bias_attr:None}
    opattrs {num_filter:64,kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bnv1_3"
  type:"batch_norm"
  top:"bnv1_3"
  bottom:"conv1_3"
  layer_param {
    idx:10
    in_0 {name:"conv1_3:0",dtype:float32,layout:NCHW,shape:[1, 64, 304, 304]}
    out_0 {name:"bnv1_3:0",dtype:float32,layout:NCHW,shape:[1, 64, 304, 304]}
    gamma {name:"bnv1_3_scale",dtype:float32,layout:O,shape:[64]}
    beta {name:"bnv1_3_offset",dtype:float32,layout:O,shape:[64]}
    mean {name:"bnv1_3_mean",dtype:float32,layout:O,shape:[64]}
    var {name:"bnv1_3_variance",dtype:float32,layout:O,shape:[64]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bnv1_3_scale')",bias_attr:"ParamAttr('bnv1_3_offset')",data_layout:"NCHW",moving_mean_name:"bnv1_3_mean",moving_variance_name:"bnv1_3_variance",use_global_stats:False,name:"bnv1_3"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_2"
  type:"relu"
  top:"relu_2"
  bottom:"bnv1_3"
  layer_param {
    idx:11
    in_0 {name:"bnv1_3:0",dtype:float32,layout:NCHW,shape:[1, 64, 304, 304]}
    out_0 {name:"relu_2:0",dtype:float32,layout:NCHW,shape:[1, 64, 304, 304]}
    opconfigs {name:"relu_2"}
  }
}
layer {
  name:"pool2d_0"
  type:"maxpool2d"
  top:"pool2d_0"
  bottom:"relu_2"
  layer_param {
    idx:12
    in_0 {name:"relu_2:0",dtype:float32,layout:NCHW,shape:[1, 64, 304, 304]}
    out_0 {name:"pool2d_0:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    opconfigs {pool_size:[3, 3],pool_type:"max",pool_stride:[2, 2],pool_padding:[1, 1],global_pooling:False,use_cudnn:True,ceil_mode:False,exclusive:True,data_format:"NCHW"}
    opattrs {kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[2, 2]}
  }
}
layer {
  name:"res2a_branch2a"
  type:"conv2d"
  top:"res2a_branch2a"
  bottom:"pool2d_0"
  layer_param {
    idx:13
    in_0 {name:"pool2d_0:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"res2a_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    weight {name:"res2a_branch2a_weights",dtype:float32,layout:OIHW,shape:[64, 64, 1, 1]}
    opconfigs {num_filters:64,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2a_branch2a_weights')",bias_attr:None}
    opattrs {num_filter:64,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2a_branch2a"
  type:"batch_norm"
  top:"bn2a_branch2a"
  bottom:"res2a_branch2a"
  layer_param {
    idx:14
    in_0 {name:"res2a_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"bn2a_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    gamma {name:"bn2a_branch2a_scale",dtype:float32,layout:O,shape:[64]}
    beta {name:"bn2a_branch2a_offset",dtype:float32,layout:O,shape:[64]}
    mean {name:"bn2a_branch2a_mean",dtype:float32,layout:O,shape:[64]}
    var {name:"bn2a_branch2a_variance",dtype:float32,layout:O,shape:[64]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2a_branch2a_scale')",bias_attr:"ParamAttr('bn2a_branch2a_offset')",data_layout:"NCHW",moving_mean_name:"bn2a_branch2a_mean",moving_variance_name:"bn2a_branch2a_variance",use_global_stats:False,name:"bn2a_branch2a"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_3"
  type:"relu"
  top:"relu_3"
  bottom:"bn2a_branch2a"
  layer_param {
    idx:15
    in_0 {name:"bn2a_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"relu_3:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    opconfigs {name:"relu_3"}
  }
}
layer {
  name:"res2a_branch2b"
  type:"conv2d"
  top:"res2a_branch2b"
  bottom:"relu_3"
  layer_param {
    idx:16
    in_0 {name:"relu_3:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"res2a_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    weight {name:"res2a_branch2b_weights",dtype:float32,layout:OIHW,shape:[64, 64, 3, 3]}
    opconfigs {num_filters:64,filter_size:3,stride:1,padding:1,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2a_branch2b_weights')",bias_attr:None}
    opattrs {num_filter:64,kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2a_branch2b"
  type:"batch_norm"
  top:"bn2a_branch2b"
  bottom:"res2a_branch2b"
  layer_param {
    idx:17
    in_0 {name:"res2a_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"bn2a_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    gamma {name:"bn2a_branch2b_scale",dtype:float32,layout:O,shape:[64]}
    beta {name:"bn2a_branch2b_offset",dtype:float32,layout:O,shape:[64]}
    mean {name:"bn2a_branch2b_mean",dtype:float32,layout:O,shape:[64]}
    var {name:"bn2a_branch2b_variance",dtype:float32,layout:O,shape:[64]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2a_branch2b_scale')",bias_attr:"ParamAttr('bn2a_branch2b_offset')",data_layout:"NCHW",moving_mean_name:"bn2a_branch2b_mean",moving_variance_name:"bn2a_branch2b_variance",use_global_stats:False,name:"bn2a_branch2b"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_4"
  type:"relu"
  top:"relu_4"
  bottom:"bn2a_branch2b"
  layer_param {
    idx:18
    in_0 {name:"bn2a_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"relu_4:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    opconfigs {name:"relu_4"}
  }
}
layer {
  name:"res2a_branch2c"
  type:"conv2d"
  top:"res2a_branch2c"
  bottom:"relu_4"
  layer_param {
    idx:19
    in_0 {name:"relu_4:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"res2a_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    weight {name:"res2a_branch2c_weights",dtype:float32,layout:OIHW,shape:[256, 64, 1, 1]}
    opconfigs {num_filters:256,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2a_branch2c_weights')",bias_attr:None}
    opattrs {num_filter:256,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2a_branch2c"
  type:"batch_norm"
  top:"bn2a_branch2c"
  bottom:"res2a_branch2c"
  layer_param {
    idx:20
    in_0 {name:"res2a_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"bn2a_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    gamma {name:"bn2a_branch2c_scale",dtype:float32,layout:O,shape:[256]}
    beta {name:"bn2a_branch2c_offset",dtype:float32,layout:O,shape:[256]}
    mean {name:"bn2a_branch2c_mean",dtype:float32,layout:O,shape:[256]}
    var {name:"bn2a_branch2c_variance",dtype:float32,layout:O,shape:[256]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2a_branch2c_scale')",bias_attr:"ParamAttr('bn2a_branch2c_offset')",data_layout:"NCHW",moving_mean_name:"bn2a_branch2c_mean",moving_variance_name:"bn2a_branch2c_variance",use_global_stats:False,name:"bn2a_branch2c"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"res2a_branch1"
  type:"conv2d"
  top:"res2a_branch1"
  bottom:"pool2d_0"
  layer_param {
    idx:21
    in_0 {name:"pool2d_0:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"res2a_branch1:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    weight {name:"res2a_branch1_weights",dtype:float32,layout:OIHW,shape:[256, 64, 1, 1]}
    opconfigs {num_filters:256,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2a_branch1_weights')",bias_attr:None}
    opattrs {num_filter:256,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2a_branch1"
  type:"batch_norm"
  top:"bn2a_branch1"
  bottom:"res2a_branch1"
  layer_param {
    idx:22
    in_0 {name:"res2a_branch1:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"bn2a_branch1:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    gamma {name:"bn2a_branch1_scale",dtype:float32,layout:O,shape:[256]}
    beta {name:"bn2a_branch1_offset",dtype:float32,layout:O,shape:[256]}
    mean {name:"bn2a_branch1_mean",dtype:float32,layout:O,shape:[256]}
    var {name:"bn2a_branch1_variance",dtype:float32,layout:O,shape:[256]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2a_branch1_scale')",bias_attr:"ParamAttr('bn2a_branch1_offset')",data_layout:"NCHW",moving_mean_name:"bn2a_branch1_mean",moving_variance_name:"bn2a_branch1_variance",use_global_stats:False,name:"bn2a_branch1"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"res2a"
  type:"add"
  top:"res2a"
  bottom:"bn2a_branch1"
  bottom:"bn2a_branch2c"
  layer_param {
    idx:23
    in_0 {name:"bn2a_branch1:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    in_1 {name:"bn2a_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"res2a:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    opconfigs {use_mkldnn:False,op_namescope:"/",op_role_var:[],x_data_format:"",op_device:"",y_data_format:"",op_role:0,axis:-1,name:"res2a"}
    opattrs {x:"bn2a_branch1:0",y:"bn2a_branch2c:0",is_broadcast:False}
  }
}
layer {
  name:"relu_5"
  type:"relu"
  top:"relu_5"
  bottom:"res2a"
  layer_param {
    idx:24
    in_0 {name:"res2a:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"relu_5:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    opconfigs {name:"relu_5"}
  }
}
layer {
  name:"res2b_branch2a"
  type:"conv2d"
  top:"res2b_branch2a"
  bottom:"relu_5"
  layer_param {
    idx:25
    in_0 {name:"relu_5:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"res2b_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    weight {name:"res2b_branch2a_weights",dtype:float32,layout:OIHW,shape:[64, 256, 1, 1]}
    opconfigs {num_filters:64,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2b_branch2a_weights')",bias_attr:None}
    opattrs {num_filter:64,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2b_branch2a"
  type:"batch_norm"
  top:"bn2b_branch2a"
  bottom:"res2b_branch2a"
  layer_param {
    idx:26
    in_0 {name:"res2b_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"bn2b_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    gamma {name:"bn2b_branch2a_scale",dtype:float32,layout:O,shape:[64]}
    beta {name:"bn2b_branch2a_offset",dtype:float32,layout:O,shape:[64]}
    mean {name:"bn2b_branch2a_mean",dtype:float32,layout:O,shape:[64]}
    var {name:"bn2b_branch2a_variance",dtype:float32,layout:O,shape:[64]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2b_branch2a_scale')",bias_attr:"ParamAttr('bn2b_branch2a_offset')",data_layout:"NCHW",moving_mean_name:"bn2b_branch2a_mean",moving_variance_name:"bn2b_branch2a_variance",use_global_stats:False,name:"bn2b_branch2a"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_6"
  type:"relu"
  top:"relu_6"
  bottom:"bn2b_branch2a"
  layer_param {
    idx:27
    in_0 {name:"bn2b_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"relu_6:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    opconfigs {name:"relu_6"}
  }
}
layer {
  name:"res2b_branch2b"
  type:"conv2d"
  top:"res2b_branch2b"
  bottom:"relu_6"
  layer_param {
    idx:28
    in_0 {name:"relu_6:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"res2b_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    weight {name:"res2b_branch2b_weights",dtype:float32,layout:OIHW,shape:[64, 64, 3, 3]}
    opconfigs {num_filters:64,filter_size:3,stride:1,padding:1,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2b_branch2b_weights')",bias_attr:None}
    opattrs {num_filter:64,kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2b_branch2b"
  type:"batch_norm"
  top:"bn2b_branch2b"
  bottom:"res2b_branch2b"
  layer_param {
    idx:29
    in_0 {name:"res2b_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"bn2b_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    gamma {name:"bn2b_branch2b_scale",dtype:float32,layout:O,shape:[64]}
    beta {name:"bn2b_branch2b_offset",dtype:float32,layout:O,shape:[64]}
    mean {name:"bn2b_branch2b_mean",dtype:float32,layout:O,shape:[64]}
    var {name:"bn2b_branch2b_variance",dtype:float32,layout:O,shape:[64]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2b_branch2b_scale')",bias_attr:"ParamAttr('bn2b_branch2b_offset')",data_layout:"NCHW",moving_mean_name:"bn2b_branch2b_mean",moving_variance_name:"bn2b_branch2b_variance",use_global_stats:False,name:"bn2b_branch2b"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_7"
  type:"relu"
  top:"relu_7"
  bottom:"bn2b_branch2b"
  layer_param {
    idx:30
    in_0 {name:"bn2b_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"relu_7:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    opconfigs {name:"relu_7"}
  }
}
layer {
  name:"res2b_branch2c"
  type:"conv2d"
  top:"res2b_branch2c"
  bottom:"relu_7"
  layer_param {
    idx:31
    in_0 {name:"relu_7:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"res2b_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    weight {name:"res2b_branch2c_weights",dtype:float32,layout:OIHW,shape:[256, 64, 1, 1]}
    opconfigs {num_filters:256,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2b_branch2c_weights')",bias_attr:None}
    opattrs {num_filter:256,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2b_branch2c"
  type:"batch_norm"
  top:"bn2b_branch2c"
  bottom:"res2b_branch2c"
  layer_param {
    idx:32
    in_0 {name:"res2b_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"bn2b_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    gamma {name:"bn2b_branch2c_scale",dtype:float32,layout:O,shape:[256]}
    beta {name:"bn2b_branch2c_offset",dtype:float32,layout:O,shape:[256]}
    mean {name:"bn2b_branch2c_mean",dtype:float32,layout:O,shape:[256]}
    var {name:"bn2b_branch2c_variance",dtype:float32,layout:O,shape:[256]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2b_branch2c_scale')",bias_attr:"ParamAttr('bn2b_branch2c_offset')",data_layout:"NCHW",moving_mean_name:"bn2b_branch2c_mean",moving_variance_name:"bn2b_branch2c_variance",use_global_stats:False,name:"bn2b_branch2c"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"res2b"
  type:"add"
  top:"res2b"
  bottom:"relu_5"
  bottom:"bn2b_branch2c"
  layer_param {
    idx:33
    in_0 {name:"relu_5:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    in_1 {name:"bn2b_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"res2b:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    opconfigs {use_mkldnn:False,op_namescope:"/",op_role_var:[],x_data_format:"",op_device:"",y_data_format:"",op_role:0,axis:-1,name:"res2b"}
    opattrs {x:"relu_5:0",y:"bn2b_branch2c:0",is_broadcast:False}
  }
}
layer {
  name:"relu_8"
  type:"relu"
  top:"relu_8"
  bottom:"res2b"
  layer_param {
    idx:34
    in_0 {name:"res2b:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"relu_8:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    opconfigs {name:"relu_8"}
  }
}
layer {
  name:"res2c_branch2a"
  type:"conv2d"
  top:"res2c_branch2a"
  bottom:"relu_8"
  layer_param {
    idx:35
    in_0 {name:"relu_8:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"res2c_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    weight {name:"res2c_branch2a_weights",dtype:float32,layout:OIHW,shape:[64, 256, 1, 1]}
    opconfigs {num_filters:64,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2c_branch2a_weights')",bias_attr:None}
    opattrs {num_filter:64,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2c_branch2a"
  type:"batch_norm"
  top:"bn2c_branch2a"
  bottom:"res2c_branch2a"
  layer_param {
    idx:36
    in_0 {name:"res2c_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"bn2c_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    gamma {name:"bn2c_branch2a_scale",dtype:float32,layout:O,shape:[64]}
    beta {name:"bn2c_branch2a_offset",dtype:float32,layout:O,shape:[64]}
    mean {name:"bn2c_branch2a_mean",dtype:float32,layout:O,shape:[64]}
    var {name:"bn2c_branch2a_variance",dtype:float32,layout:O,shape:[64]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2c_branch2a_scale')",bias_attr:"ParamAttr('bn2c_branch2a_offset')",data_layout:"NCHW",moving_mean_name:"bn2c_branch2a_mean",moving_variance_name:"bn2c_branch2a_variance",use_global_stats:False,name:"bn2c_branch2a"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_9"
  type:"relu"
  top:"relu_9"
  bottom:"bn2c_branch2a"
  layer_param {
    idx:37
    in_0 {name:"bn2c_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"relu_9:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    opconfigs {name:"relu_9"}
  }
}
layer {
  name:"res2c_branch2b"
  type:"conv2d"
  top:"res2c_branch2b"
  bottom:"relu_9"
  layer_param {
    idx:38
    in_0 {name:"relu_9:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"res2c_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    weight {name:"res2c_branch2b_weights",dtype:float32,layout:OIHW,shape:[64, 64, 3, 3]}
    opconfigs {num_filters:64,filter_size:3,stride:1,padding:1,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2c_branch2b_weights')",bias_attr:None}
    opattrs {num_filter:64,kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2c_branch2b"
  type:"batch_norm"
  top:"bn2c_branch2b"
  bottom:"res2c_branch2b"
  layer_param {
    idx:39
    in_0 {name:"res2c_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"bn2c_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    gamma {name:"bn2c_branch2b_scale",dtype:float32,layout:O,shape:[64]}
    beta {name:"bn2c_branch2b_offset",dtype:float32,layout:O,shape:[64]}
    mean {name:"bn2c_branch2b_mean",dtype:float32,layout:O,shape:[64]}
    var {name:"bn2c_branch2b_variance",dtype:float32,layout:O,shape:[64]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2c_branch2b_scale')",bias_attr:"ParamAttr('bn2c_branch2b_offset')",data_layout:"NCHW",moving_mean_name:"bn2c_branch2b_mean",moving_variance_name:"bn2c_branch2b_variance",use_global_stats:False,name:"bn2c_branch2b"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_10"
  type:"relu"
  top:"relu_10"
  bottom:"bn2c_branch2b"
  layer_param {
    idx:40
    in_0 {name:"bn2c_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"relu_10:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    opconfigs {name:"relu_10"}
  }
}
layer {
  name:"res2c_branch2c"
  type:"conv2d"
  top:"res2c_branch2c"
  bottom:"relu_10"
  layer_param {
    idx:41
    in_0 {name:"relu_10:0",dtype:float32,layout:NCHW,shape:[1, 64, 152, 152]}
    out_0 {name:"res2c_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    weight {name:"res2c_branch2c_weights",dtype:float32,layout:OIHW,shape:[256, 64, 1, 1]}
    opconfigs {num_filters:256,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res2c_branch2c_weights')",bias_attr:None}
    opattrs {num_filter:256,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn2c_branch2c"
  type:"batch_norm"
  top:"bn2c_branch2c"
  bottom:"res2c_branch2c"
  layer_param {
    idx:42
    in_0 {name:"res2c_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"bn2c_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    gamma {name:"bn2c_branch2c_scale",dtype:float32,layout:O,shape:[256]}
    beta {name:"bn2c_branch2c_offset",dtype:float32,layout:O,shape:[256]}
    mean {name:"bn2c_branch2c_mean",dtype:float32,layout:O,shape:[256]}
    var {name:"bn2c_branch2c_variance",dtype:float32,layout:O,shape:[256]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn2c_branch2c_scale')",bias_attr:"ParamAttr('bn2c_branch2c_offset')",data_layout:"NCHW",moving_mean_name:"bn2c_branch2c_mean",moving_variance_name:"bn2c_branch2c_variance",use_global_stats:False,name:"bn2c_branch2c"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"res2c"
  type:"add"
  top:"res2c"
  bottom:"relu_8"
  bottom:"bn2c_branch2c"
  layer_param {
    idx:43
    in_0 {name:"relu_8:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    in_1 {name:"bn2c_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"res2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    opconfigs {use_mkldnn:False,op_namescope:"/",op_role_var:[],x_data_format:"",op_device:"",y_data_format:"",op_role:0,axis:-1,name:"res2c"}
    opattrs {x:"relu_8:0",y:"bn2c_branch2c:0",is_broadcast:False}
  }
}
layer {
  name:"relu_11"
  type:"relu"
  top:"relu_11"
  bottom:"res2c"
  layer_param {
    idx:44
    in_0 {name:"res2c:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"relu_11:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    opconfigs {name:"relu_11"}
  }
}
layer {
  name:"res3a_branch2a"
  type:"conv2d"
  top:"res3a_branch2a"
  bottom:"relu_11"
  layer_param {
    idx:45
    in_0 {name:"relu_11:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"res3a_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 152, 152]}
    weight {name:"res3a_branch2a_weights",dtype:float32,layout:OIHW,shape:[128, 256, 1, 1]}
    opconfigs {num_filters:128,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3a_branch2a_weights')",bias_attr:None}
    opattrs {num_filter:128,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3a_branch2a"
  type:"batch_norm"
  top:"bn3a_branch2a"
  bottom:"res3a_branch2a"
  layer_param {
    idx:46
    in_0 {name:"res3a_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 152, 152]}
    out_0 {name:"bn3a_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 152, 152]}
    gamma {name:"bn3a_branch2a_scale",dtype:float32,layout:O,shape:[128]}
    beta {name:"bn3a_branch2a_offset",dtype:float32,layout:O,shape:[128]}
    mean {name:"bn3a_branch2a_mean",dtype:float32,layout:O,shape:[128]}
    var {name:"bn3a_branch2a_variance",dtype:float32,layout:O,shape:[128]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3a_branch2a_scale')",bias_attr:"ParamAttr('bn3a_branch2a_offset')",data_layout:"NCHW",moving_mean_name:"bn3a_branch2a_mean",moving_variance_name:"bn3a_branch2a_variance",use_global_stats:False,name:"bn3a_branch2a"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_12"
  type:"relu"
  top:"relu_12"
  bottom:"bn3a_branch2a"
  layer_param {
    idx:47
    in_0 {name:"bn3a_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 152, 152]}
    out_0 {name:"relu_12:0",dtype:float32,layout:NCHW,shape:[1, 128, 152, 152]}
    opconfigs {name:"relu_12"}
  }
}
layer {
  name:"res3a_branch2b"
  type:"conv2d"
  top:"res3a_branch2b"
  bottom:"relu_12"
  layer_param {
    idx:48
    in_0 {name:"relu_12:0",dtype:float32,layout:NCHW,shape:[1, 128, 152, 152]}
    out_0 {name:"res3a_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    weight {name:"res3a_branch2b_weights",dtype:float32,layout:OIHW,shape:[128, 128, 3, 3]}
    opconfigs {num_filters:128,filter_size:3,stride:2,padding:1,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3a_branch2b_weights')",bias_attr:None}
    opattrs {num_filter:128,kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[2, 2],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3a_branch2b"
  type:"batch_norm"
  top:"bn3a_branch2b"
  bottom:"res3a_branch2b"
  layer_param {
    idx:49
    in_0 {name:"res3a_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"bn3a_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    gamma {name:"bn3a_branch2b_scale",dtype:float32,layout:O,shape:[128]}
    beta {name:"bn3a_branch2b_offset",dtype:float32,layout:O,shape:[128]}
    mean {name:"bn3a_branch2b_mean",dtype:float32,layout:O,shape:[128]}
    var {name:"bn3a_branch2b_variance",dtype:float32,layout:O,shape:[128]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3a_branch2b_scale')",bias_attr:"ParamAttr('bn3a_branch2b_offset')",data_layout:"NCHW",moving_mean_name:"bn3a_branch2b_mean",moving_variance_name:"bn3a_branch2b_variance",use_global_stats:False,name:"bn3a_branch2b"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_13"
  type:"relu"
  top:"relu_13"
  bottom:"bn3a_branch2b"
  layer_param {
    idx:50
    in_0 {name:"bn3a_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"relu_13:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    opconfigs {name:"relu_13"}
  }
}
layer {
  name:"res3a_branch2c"
  type:"conv2d"
  top:"res3a_branch2c"
  bottom:"relu_13"
  layer_param {
    idx:51
    in_0 {name:"relu_13:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"res3a_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    weight {name:"res3a_branch2c_weights",dtype:float32,layout:OIHW,shape:[512, 128, 1, 1]}
    opconfigs {num_filters:512,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3a_branch2c_weights')",bias_attr:None}
    opattrs {num_filter:512,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3a_branch2c"
  type:"batch_norm"
  top:"bn3a_branch2c"
  bottom:"res3a_branch2c"
  layer_param {
    idx:52
    in_0 {name:"res3a_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"bn3a_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    gamma {name:"bn3a_branch2c_scale",dtype:float32,layout:O,shape:[512]}
    beta {name:"bn3a_branch2c_offset",dtype:float32,layout:O,shape:[512]}
    mean {name:"bn3a_branch2c_mean",dtype:float32,layout:O,shape:[512]}
    var {name:"bn3a_branch2c_variance",dtype:float32,layout:O,shape:[512]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3a_branch2c_scale')",bias_attr:"ParamAttr('bn3a_branch2c_offset')",data_layout:"NCHW",moving_mean_name:"bn3a_branch2c_mean",moving_variance_name:"bn3a_branch2c_variance",use_global_stats:False,name:"bn3a_branch2c"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"pool2d_1"
  type:"avgpool2d"
  top:"pool2d_1"
  bottom:"relu_11"
  layer_param {
    idx:53
    in_0 {name:"relu_11:0",dtype:float32,layout:NCHW,shape:[1, 256, 152, 152]}
    out_0 {name:"pool2d_1:0",dtype:float32,layout:NCHW,shape:[1, 256, 76, 76]}
    opconfigs {pool_size:[2, 2],pool_type:"avg",pool_stride:[2, 2],pool_padding:[0, 0],global_pooling:False,use_cudnn:True,ceil_mode:True,exclusive:True,data_format:"NCHW"}
    opattrs {kernel_size:[2, 2],padding:[[0, 0], [0, 0]],stride:[2, 2]}
  }
}
layer {
  name:"res3a_branch1"
  type:"conv2d"
  top:"res3a_branch1"
  bottom:"pool2d_1"
  layer_param {
    idx:54
    in_0 {name:"pool2d_1:0",dtype:float32,layout:NCHW,shape:[1, 256, 76, 76]}
    out_0 {name:"res3a_branch1:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    weight {name:"res3a_branch1_weights",dtype:float32,layout:OIHW,shape:[512, 256, 1, 1]}
    opconfigs {num_filters:512,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3a_branch1_weights')",bias_attr:None}
    opattrs {num_filter:512,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3a_branch1"
  type:"batch_norm"
  top:"bn3a_branch1"
  bottom:"res3a_branch1"
  layer_param {
    idx:55
    in_0 {name:"res3a_branch1:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"bn3a_branch1:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    gamma {name:"bn3a_branch1_scale",dtype:float32,layout:O,shape:[512]}
    beta {name:"bn3a_branch1_offset",dtype:float32,layout:O,shape:[512]}
    mean {name:"bn3a_branch1_mean",dtype:float32,layout:O,shape:[512]}
    var {name:"bn3a_branch1_variance",dtype:float32,layout:O,shape:[512]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3a_branch1_scale')",bias_attr:"ParamAttr('bn3a_branch1_offset')",data_layout:"NCHW",moving_mean_name:"bn3a_branch1_mean",moving_variance_name:"bn3a_branch1_variance",use_global_stats:False,name:"bn3a_branch1"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"res3a"
  type:"add"
  top:"res3a"
  bottom:"bn3a_branch1"
  bottom:"bn3a_branch2c"
  layer_param {
    idx:56
    in_0 {name:"bn3a_branch1:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    in_1 {name:"bn3a_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"res3a:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    opconfigs {use_mkldnn:False,op_namescope:"/",op_role_var:[],x_data_format:"",op_device:"",y_data_format:"",op_role:0,axis:-1,name:"res3a"}
    opattrs {x:"bn3a_branch1:0",y:"bn3a_branch2c:0",is_broadcast:False}
  }
}
layer {
  name:"relu_14"
  type:"relu"
  top:"relu_14"
  bottom:"res3a"
  layer_param {
    idx:57
    in_0 {name:"res3a:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"relu_14:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    opconfigs {name:"relu_14"}
  }
}
layer {
  name:"res3b_branch2a"
  type:"conv2d"
  top:"res3b_branch2a"
  bottom:"relu_14"
  layer_param {
    idx:58
    in_0 {name:"relu_14:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"res3b_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    weight {name:"res3b_branch2a_weights",dtype:float32,layout:OIHW,shape:[128, 512, 1, 1]}
    opconfigs {num_filters:128,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3b_branch2a_weights')",bias_attr:None}
    opattrs {num_filter:128,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3b_branch2a"
  type:"batch_norm"
  top:"bn3b_branch2a"
  bottom:"res3b_branch2a"
  layer_param {
    idx:59
    in_0 {name:"res3b_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"bn3b_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    gamma {name:"bn3b_branch2a_scale",dtype:float32,layout:O,shape:[128]}
    beta {name:"bn3b_branch2a_offset",dtype:float32,layout:O,shape:[128]}
    mean {name:"bn3b_branch2a_mean",dtype:float32,layout:O,shape:[128]}
    var {name:"bn3b_branch2a_variance",dtype:float32,layout:O,shape:[128]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3b_branch2a_scale')",bias_attr:"ParamAttr('bn3b_branch2a_offset')",data_layout:"NCHW",moving_mean_name:"bn3b_branch2a_mean",moving_variance_name:"bn3b_branch2a_variance",use_global_stats:False,name:"bn3b_branch2a"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_15"
  type:"relu"
  top:"relu_15"
  bottom:"bn3b_branch2a"
  layer_param {
    idx:60
    in_0 {name:"bn3b_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"relu_15:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    opconfigs {name:"relu_15"}
  }
}
layer {
  name:"res3b_branch2b"
  type:"conv2d"
  top:"res3b_branch2b"
  bottom:"relu_15"
  layer_param {
    idx:61
    in_0 {name:"relu_15:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"res3b_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    weight {name:"res3b_branch2b_weights",dtype:float32,layout:OIHW,shape:[128, 128, 3, 3]}
    opconfigs {num_filters:128,filter_size:3,stride:1,padding:1,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3b_branch2b_weights')",bias_attr:None}
    opattrs {num_filter:128,kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3b_branch2b"
  type:"batch_norm"
  top:"bn3b_branch2b"
  bottom:"res3b_branch2b"
  layer_param {
    idx:62
    in_0 {name:"res3b_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"bn3b_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    gamma {name:"bn3b_branch2b_scale",dtype:float32,layout:O,shape:[128]}
    beta {name:"bn3b_branch2b_offset",dtype:float32,layout:O,shape:[128]}
    mean {name:"bn3b_branch2b_mean",dtype:float32,layout:O,shape:[128]}
    var {name:"bn3b_branch2b_variance",dtype:float32,layout:O,shape:[128]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3b_branch2b_scale')",bias_attr:"ParamAttr('bn3b_branch2b_offset')",data_layout:"NCHW",moving_mean_name:"bn3b_branch2b_mean",moving_variance_name:"bn3b_branch2b_variance",use_global_stats:False,name:"bn3b_branch2b"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_16"
  type:"relu"
  top:"relu_16"
  bottom:"bn3b_branch2b"
  layer_param {
    idx:63
    in_0 {name:"bn3b_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"relu_16:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    opconfigs {name:"relu_16"}
  }
}
layer {
  name:"res3b_branch2c"
  type:"conv2d"
  top:"res3b_branch2c"
  bottom:"relu_16"
  layer_param {
    idx:64
    in_0 {name:"relu_16:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"res3b_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    weight {name:"res3b_branch2c_weights",dtype:float32,layout:OIHW,shape:[512, 128, 1, 1]}
    opconfigs {num_filters:512,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3b_branch2c_weights')",bias_attr:None}
    opattrs {num_filter:512,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3b_branch2c"
  type:"batch_norm"
  top:"bn3b_branch2c"
  bottom:"res3b_branch2c"
  layer_param {
    idx:65
    in_0 {name:"res3b_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"bn3b_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    gamma {name:"bn3b_branch2c_scale",dtype:float32,layout:O,shape:[512]}
    beta {name:"bn3b_branch2c_offset",dtype:float32,layout:O,shape:[512]}
    mean {name:"bn3b_branch2c_mean",dtype:float32,layout:O,shape:[512]}
    var {name:"bn3b_branch2c_variance",dtype:float32,layout:O,shape:[512]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3b_branch2c_scale')",bias_attr:"ParamAttr('bn3b_branch2c_offset')",data_layout:"NCHW",moving_mean_name:"bn3b_branch2c_mean",moving_variance_name:"bn3b_branch2c_variance",use_global_stats:False,name:"bn3b_branch2c"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"res3b"
  type:"add"
  top:"res3b"
  bottom:"relu_14"
  bottom:"bn3b_branch2c"
  layer_param {
    idx:66
    in_0 {name:"relu_14:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    in_1 {name:"bn3b_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"res3b:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    opconfigs {use_mkldnn:False,op_namescope:"/",op_role_var:[],x_data_format:"",op_device:"",y_data_format:"",op_role:0,axis:-1,name:"res3b"}
    opattrs {x:"relu_14:0",y:"bn3b_branch2c:0",is_broadcast:False}
  }
}
layer {
  name:"relu_17"
  type:"relu"
  top:"relu_17"
  bottom:"res3b"
  layer_param {
    idx:67
    in_0 {name:"res3b:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"relu_17:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    opconfigs {name:"relu_17"}
  }
}
layer {
  name:"res3c_branch2a"
  type:"conv2d"
  top:"res3c_branch2a"
  bottom:"relu_17"
  layer_param {
    idx:68
    in_0 {name:"relu_17:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"res3c_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    weight {name:"res3c_branch2a_weights",dtype:float32,layout:OIHW,shape:[128, 512, 1, 1]}
    opconfigs {num_filters:128,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3c_branch2a_weights')",bias_attr:None}
    opattrs {num_filter:128,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3c_branch2a"
  type:"batch_norm"
  top:"bn3c_branch2a"
  bottom:"res3c_branch2a"
  layer_param {
    idx:69
    in_0 {name:"res3c_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"bn3c_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    gamma {name:"bn3c_branch2a_scale",dtype:float32,layout:O,shape:[128]}
    beta {name:"bn3c_branch2a_offset",dtype:float32,layout:O,shape:[128]}
    mean {name:"bn3c_branch2a_mean",dtype:float32,layout:O,shape:[128]}
    var {name:"bn3c_branch2a_variance",dtype:float32,layout:O,shape:[128]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3c_branch2a_scale')",bias_attr:"ParamAttr('bn3c_branch2a_offset')",data_layout:"NCHW",moving_mean_name:"bn3c_branch2a_mean",moving_variance_name:"bn3c_branch2a_variance",use_global_stats:False,name:"bn3c_branch2a"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_18"
  type:"relu"
  top:"relu_18"
  bottom:"bn3c_branch2a"
  layer_param {
    idx:70
    in_0 {name:"bn3c_branch2a:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"relu_18:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    opconfigs {name:"relu_18"}
  }
}
layer {
  name:"res3c_branch2b"
  type:"conv2d"
  top:"res3c_branch2b"
  bottom:"relu_18"
  layer_param {
    idx:71
    in_0 {name:"relu_18:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"res3c_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    weight {name:"res3c_branch2b_weights",dtype:float32,layout:OIHW,shape:[128, 128, 3, 3]}
    opconfigs {num_filters:128,filter_size:3,stride:1,padding:1,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3c_branch2b_weights')",bias_attr:None}
    opattrs {num_filter:128,kernel_size:[3, 3],padding:[[1, 1], [1, 1]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3c_branch2b"
  type:"batch_norm"
  top:"bn3c_branch2b"
  bottom:"res3c_branch2b"
  layer_param {
    idx:72
    in_0 {name:"res3c_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"bn3c_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    gamma {name:"bn3c_branch2b_scale",dtype:float32,layout:O,shape:[128]}
    beta {name:"bn3c_branch2b_offset",dtype:float32,layout:O,shape:[128]}
    mean {name:"bn3c_branch2b_mean",dtype:float32,layout:O,shape:[128]}
    var {name:"bn3c_branch2b_variance",dtype:float32,layout:O,shape:[128]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3c_branch2b_scale')",bias_attr:"ParamAttr('bn3c_branch2b_offset')",data_layout:"NCHW",moving_mean_name:"bn3c_branch2b_mean",moving_variance_name:"bn3c_branch2b_variance",use_global_stats:False,name:"bn3c_branch2b"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"relu_19"
  type:"relu"
  top:"relu_19"
  bottom:"bn3c_branch2b"
  layer_param {
    idx:73
    in_0 {name:"bn3c_branch2b:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"relu_19:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    opconfigs {name:"relu_19"}
  }
}
layer {
  name:"res3c_branch2c"
  type:"conv2d"
  top:"res3c_branch2c"
  bottom:"relu_19"
  layer_param {
    idx:74
    in_0 {name:"relu_19:0",dtype:float32,layout:NCHW,shape:[1, 128, 76, 76]}
    out_0 {name:"res3c_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    weight {name:"res3c_branch2c_weights",dtype:float32,layout:OIHW,shape:[512, 128, 1, 1]}
    opconfigs {num_filters:512,filter_size:1,stride:1,padding:0,dilation:1,groups:1,use_cudnn:True,act:None,data_format:"NCHW",param_attr:"ParamAttr('res3c_branch2c_weights')",bias_attr:None}
    opattrs {num_filter:512,kernel_size:[1, 1],padding:[[0, 0], [0, 0]],stride:[1, 1],use_bias:False,dilation:[1, 1],num_group:1}
  }
}
layer {
  name:"bn3c_branch2c"
  type:"batch_norm"
  top:"bn3c_branch2c"
  bottom:"res3c_branch2c"
  layer_param {
    idx:75
    in_0 {name:"res3c_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"bn3c_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    gamma {name:"bn3c_branch2c_scale",dtype:float32,layout:O,shape:[512]}
    beta {name:"bn3c_branch2c_offset",dtype:float32,layout:O,shape:[512]}
    mean {name:"bn3c_branch2c_mean",dtype:float32,layout:O,shape:[512]}
    var {name:"bn3c_branch2c_variance",dtype:float32,layout:O,shape:[512]}
    opconfigs {act:None,is_test:True,momentum:0.8999999761581421,epsilon:9.999999747378752e-06,param_attr:"ParamAttr('bn3c_branch2c_scale')",bias_attr:"ParamAttr('bn3c_branch2c_offset')",data_layout:"NCHW",moving_mean_name:"bn3c_branch2c_mean",moving_variance_name:"bn3c_branch2c_variance",use_global_stats:False,name:"bn3c_branch2c"}
    opattrs {epsilon:9.999999747378752e-06,scale:True,center:True}
  }
}
layer {
  name:"res3c"
  type:"add"
  top:"res3c"
  bottom:"relu_17"
  bottom:"bn3c_branch2c"
  layer_param {
    idx:76
    in_0 {name:"relu_17:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    in_1 {name:"bn3c_branch2c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    out_0 {name:"res3c:0",dtype:float32,layout:NCHW,shape:[1, 512, 76, 76]}
    opconfigs {use_mkldnn:False,op_namescope:"/",op_role_var:[],x_data_format:"",op_device:"",y_data_format:"",op_role:0,axis:-1,name:"res3c"}
    opattrs {x:"relu_17:0",y:"bn3c_branch2c:0",is_broadcast:False}
  }
}
layer {
  name:"relu_20"
  type:"relu"
  top:"relu_20"
  bottom:"res3c"
  layer_param {
    idx:77
